In [135]:
import pandas as pd

## Series

In [136]:
data = [1, 2, 3, 4, 5]

In [137]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [138]:
index = ['Linha ' + str(i) for i in range(5)]

In [139]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [140]:
s = pd.Series(data, index = index)

In [141]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [142]:
data = {'Linha ' + str(i) : i + 1 for i in range(5)}

In [143]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [144]:
s = pd.Series(data)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [145]:
s1 = s+2
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [146]:
s2 = s + s1
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

## DataFrame

In [173]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [174]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [175]:
df1 = pd.DataFrame(data)

In [176]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [177]:
index = ['Linha' + str(i) for i in range(3)]

In [178]:
index

['Linha0', 'Linha1', 'Linha2']

In [179]:
df1 = pd.DataFrame(data, index = index)

In [180]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [182]:
Column = ['Column' + str(i) for i in range(3)]

In [183]:
df1 = pd.DataFrame(data, index = index, columns = Column)

In [184]:
df1

        Column0  Column1  Column2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [185]:
dataf = {'Column0' : {'Linha0' : 1, 'Linha1' : 4, 'Linha2' : 7},
        'Column1' : {'Linha0' : 2, 'Linha1' : 5, 'Linha2' : 8},
        'Column2' : {'Linha0' : 3, 'Linha1' : 6, 'Linha2' : 9}}

In [186]:
dataf

{'Column0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Column1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Column2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [187]:
df2 = pd.DataFrame(dataf)

In [188]:
df2

        Column0  Column1  Column2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [189]:
data = [(1, 2, 3),
        (4, 5, 6),
        (7, 8, 9)]

In [190]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [191]:
df3 = pd.DataFrame(data, index = index, columns = column)

In [192]:
df3

        Column0  Column1  Column2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [193]:
df1[df1 > 0] = 'A'

In [194]:
df1

       Column0 Column1 Column2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [195]:
df2[df2 > 0] = 'B'

In [196]:
df2

       Column0 Column1 Column2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [197]:
df3[df3 > 0] = 'C'

In [198]:
df3

       Column0 Column1 Column2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [199]:
df4 = pd.concat([df1, df2, df3])

In [200]:
df4

       Column0 Column1 Column2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C